Revit 2026 API

# SteelElementPropertiesGetReference Method

---

This method will return the reference for the given fabrication id.

**Namespace:** Autodesk.Revit.DB.Steel**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public static Reference GetReference(
	Document aDoc,
	Guid guid
)
```
```vb
Public Shared Function GetReference (
	aDoc As Document,
	guid As Guid
) As Reference
```
```cpp
public:
static Reference^ GetReference(
	Document^ aDoc,
	Guid guid
)
```
```fsharp
static member GetReference :
        aDoc : Document *
        guid : Guid -> Reference
```

#### Parameters

aDoc Document
     Document in which to search for the reference.
guid Guid
     The fabrication id for which a reference is required.

#### Return Value

Reference The reference to the element or subelement corresponding to the given id.

| Exception | Condition |
| --- | --- |
| ArgumentNullException | A non-optional argument was null |

#### Reference

SteelElementProperties Class

Autodesk.Revit.DB.Steel Namespace